Revit 2027 API
ElementCategoryFilter.CategoryId Property
 The category id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CategoryId { get; }
Public ReadOnly Property CategoryId As ElementId
	Get
public:
property ElementId^ CategoryId {
	ElementId^ get ();
}
member CategoryId : ElementId with get
Property Value
ElementId
See Also
Reference
ElementCategoryFilter Class
Autodesk.Revit.DB Namespace